#ifndef TASK_03_SCENE_H
#define TASK_03_SCENE_H

class Scene
{

    GL::Camera camera;              // Мы предоставляем Вам реализацию камеры. В OpenGL камера - это просто 2 матрицы. Модельно-видовая матрица и матрица проекции. // ###
                                    // Задача этого класса только в том чтобы обработать ввод с клавиатуры и правильно сформировать эти матрицы.
                                    // Вы можете просто пользоваться этим классом для расчёта указанных матриц.

};

#endif //TASK_03_SCENE_H
